Repository: Navaphon001/Health-Tracking
Catalog: *_app/lib/l10n/app_*.arb
Languages: th

# appTitle
source: Personal Wellness Tracker
th: ตัวติดตามสุขภาพส่วนบุคคล

source: Dashboard
th: แดชบอร์ด

source: Settings
th: การตั้งค่า

source: Account
th: บัญชี

source: Language
th: ภาษา

source: Notifications
th: การแจ้งเตือน

source: Dark Mode
th: โหมดมืด

source: Sign Out
th: ออกจากระบบ

source: Light
th: สว่าง

source: Dark
th: มืด

source: English
th: อังกฤษ

source: Thai
th: ไทย

source: Profile
th: โปรไฟล์

source: Profile setup
th: ตั้งค่าโปรไฟล์

# stepOf
source: Step {current} of {total}
th: ขั้นตอน {current} จาก {total}

source: Add Profile Photo
th: เพิ่มรูปโปรไฟล์

source: Name
th: ชื่อ

# nameHint
source: Your name
th: ชื่อของคุณ

# dob
source: Date of Birth
th: วันเดือนปีเกิด

# dobHint
source: dd/mm/yyyy
th: วว/ดด/ปปปป

source: Gender
th: เพศ

source: Male
th: ชาย

source: Female
th: หญิง

source: Other
th: อื่น ๆ

source: Next
th: ถัดไป

source: Open Profile Setup
th: เปิดหน้าตั้งค่าโปรไฟล์

source: Physical Info
th: ข้อมูลร่างกาย

source: Weight
th: น้ำหนัก

# weightHint
source: kg
th: กก.

source: Height
th: ส่วนสูง

# heightHint
source: cm
th: ซม.

source: Activity Level
th: ระดับกิจกรรม

# sedentary
source: Sedentary: Little to no exercise
th: นั่งทำงาน: ออกกำลังกายน้อยหรือไม่เลย

# lightlyActive
source: Lightly Active: Light exercise 1-3 days/week
th: กิจกรรมเบา: ออกกำลังกายเบา 1-3 วัน/สัปดาห์

# moderatelyActive
source: Moderately Active: Moderate exercise 3-5 days/week
th: กิจกรรมปานกลาง: ออกกำลังกายปานกลาง 3-5 วัน/สัปดาห์

# veryActive
source: Very Active: Hard exercise 6-7 days/week
th: กิจกรรมหนัก: ออกกำลังกายหนัก 6-7 วัน/สัปดาห์

source: Open Profile Setup Step 2
th: เปิดหน้าตั้งค่าโปรไฟล์ขั้นตอนที่ 2

source: SKIP
th: ข้าม

source: Get Started
th: เริ่มต้นใช้งาน

# trackHealthTitle
source: Track Your Health
th: ติดตามสุขภาพของคุณ

# trackHealthDesc
source: Monitor your daily activities, workouts, and health metrics to stay on track with your wellness goals.
th: ติดตามกิจกรรมประจำวัน การออกกำลังกาย และเมตริกสุขภาพเพื่อให้อยู่ในเป้าหมายสุขภาพของคุณ

# setGoalsTitle
source: Set Your Goals
th: ตั้งเป้าหมายของคุณ

# setGoalsDesc
source: Define your fitness and health objectives to create a personalized plan that works best for you.
th: กำหนดเป้าหมายด้านฟิตเนสและสุขภาพเพื่อสร้างแผนส่วนบุคคลที่เหมาะสมที่สุดสำหรับคุณ

# analyzeProgressTitle
source: Analyze Progress
th: วิเคราะห์ความก้าวหน้า

# analyzeProgressDesc
source: View detailed insights and charts to understand your health trends and celebrate your achievements.
th: ดูข้อมูลเชิงลึกและแผนภูมิโดยละเอียดเพื่อทำความเข้าใจเทรนด์สุขภาพของคุณและเฉลิมฉลองความสำเร็จ

source: About Yourself
th: เกี่ยวกับตัวคุณ

# healthRatingQuestion
source: How would you describe your current health?
th: คุณจะอธิบายสุขภาพปัจจุบันของคุณอย่างไร?

# healthPoor
source: Poor
th: แย่

# healthFair
source: Fair
th: พอใช้

# healthGood
source: Good
th: ดี

# healthGreat
source: Great
th: ดีมาก

# healthExcellent
source: Excellent
th: ยอดเยี่ยม

# yourGoals
source: What are your main goals?
th: เป้าหมายหลักของคุณคืออะไร?

# goalLoseWeight
source: Lose Weight
th: ลดน้ำหนัก

# goalBuildMuscle
source: Build Muscle
th: สร้างกล้ามเนื้อ

# goalImproveFitness
source: Improve Fitness
th: เพิ่มความแข็งแรง

# goalBetterSleep
source: Better Sleep
th: นอนหลับดีขึ้น

# goalEatHealthier
source: Eat Healthier
th: กินอาหารเพื่อสุขภาพ

# goalAndAchievement
source: Goals & Achievements
th: เป้าหมายและความสำเร็จ

source: Open Profile Setup Step 3
th: เปิดหน้าตั้งค่าโปรไฟล์ขั้นตอนที่ 3

source: Finish
th: เสร็จสิ้น

source: Welcome Back!
th: ยินดีต้อนรับกลับ!

source: Email
th: อีเมล

source: Password
th: รหัสผ่าน

source: Please enter email
th: กรุณากรอกอีเมล

source: Invalid email format
th: รูปแบบอีเมลไม่ถูกต้อง

source: Please enter password
th: กรุณากรอกรหัสผ่าน

# passwordMinLength
source: Password must be at least 6 characters
th: รหัสผ่านต้องมีอย่างน้อย 6 ตัวอักษร

source: Forgot password?
th: ลืมรหัสผ่าน?

source: Sign In
th: เข้าสู่ระบบ

# dontHaveAccount
source: Don't have an account?
th: ยังไม่มีบัญชี?

source: Register
th: สมัครสมาชิก

# waterIntakeTitle
source: Water Intake
th: การดื่มน้ำ

# dailyWaterLogSubtitle
source: Record your daily water intake
th: บันทึกการดื่มน้ำประจำวัน

source: Water Intake
th: การดื่มน้ำ

source: Daily Water Log
th: บันทึกการดื่มน้ำประจำวัน

source: Select Beverage
th: เลือกเครื่องดื่ม

source: Add Beverage
th: เพิ่มเครื่องดื่ม

source: Add
th: เพิ่ม

source: Save
th: บันทึก

source: Cancel
th: ยกเลิก

source: Edit
th: แก้ไข

# pleaseSelectBeverage
source: Please select a beverage first
th: กรุณาเลือกเครื่องดื่มก่อน

# pleaseEnterAmount
source: Please enter amount (ml)
th: โปรดระบุปริมาณ (ml)

source: Beverage added
th: เพิ่มเครื่องดื่มแล้ว

source: Exercise
th: การออกกำลังกาย

# noActivitiesYet
source: No activities added yet
th: ยังไม่มีกิจกรรมที่เพิ่ม

source: Reset
th: รีเซ็ต

source: Stop
th: หยุด

source: Start
th: เริ่ม

source: Select Duration
th: เลือกระยะเวลา

source: Use
th: ใช้

source: Add Activity
th: เพิ่มกิจกรรม

source: Edit Activity
th: แก้ไขกิจกรรม

source: Activity Name
th: ชื่อกิจกรรม

source: Duration
th: ระยะเวลา

source: Pick
th: เลือก

source: Start Time
th: เวลาเริ่ม

source: Now
th: ตอนนี้

source: Done
th: เสร็จแล้ว

source: min
th: นาที

source: Sleep Logged
th: บันทึกการนอน

source: Meals Logged
th: บันทึกอาหาร

# errorOccurred
source: An error occurred
th: เกิดข้อผิดพลาด

source: Home
th: หน้าแรก

source: Meal
th: อาหาร

source: Water
th: น้ำ

source: Sleep
th: นอน

source: Create your account
th: สร้างบัญชีของคุณ

source: Username
th: ชื่อผู้ใช้

# pleaseEnterUsername
source: Please enter a username
th: กรุณากรอกชื่อผู้ใช้

source: Please enter an email
th: กรุณากรอกอีเมล

# passwordMinimum6Chars
source: Password must be at least 6 characters
th: รหัสผ่านต้องมีอย่างน้อย 6 ตัวอักษร

source: Confirm password
th: ยืนยันรหัสผ่าน

# pleaseConfirmPassword
source: Please confirm your password
th: กรุณายืนยันรหัสผ่าน

source: Passwords do not match
th: รหัสผ่านไม่ตรงกัน

source: Create account
th: สร้างบัญชี

source: Have an account?
th: มีบัญชีแล้ว?

# passwordMismatch
source: Passwords do not match
th: รหัสผ่านไม่ตรงกัน

source: Bedtime
th: เวลานอน

source: Wake-up Time
th: เวลาตื่น

source: Log Sleep
th: บันทึกการนอน

source: last night
th: เมื่อคืน

source: Add Water
th: เพิ่มน้ำ

source: Select Activity
th: เลือกกิจกรรม

# goodMorning
source: Good morning, Alex!
th: สวัสดีตอนเช้า, Alex!

# date
source: Date {date}
th: วันที่ {date}

# waterIntakeLabel
source: Water Intake
th: การดื่มน้ำ

# exerciseLabel
source: Exercise
th: การออกกำลังกาย

# sleepLoggedLabel
source: Sleep Logged
th: บันทึกการนอน

# mealsLoggedLabel
source: Meals Logged
th: บันทึกอาหาร

# todayMood
source: Today's Mood
th: อารมณ์วันนี้

# todayProgress
source: Today's Progress
th: การดำเนินการวันนี้

# todayWeight
source: Today's Weight
th: น้ำหนักวันนี้

source: Weight (kg)
th: น้ำหนัก (kg)

source: Height (cm)
th: ส่วนสูง (cm)

source: Share
th: แชร์

source: Share Data
th: แชร์ข้อมูล

source: Export to PDF
th: ส่งออกเป็น PDF

# saveDataAsPDF
source: Save data as PDF file
th: บันทึกข้อมูลเป็นไฟล์ PDF

source: Share to other apps
th: แชร์ไปยังแอพอื่น

source: No data to share
th: ไม่มีข้อมูลสำหรับแชร์

# errorOccurredMessage
source: An error occurred: {error}
th: เกิดข้อผิดพลาด: {error}

# noDataToPDF
source: No data to create PDF
th: ไม่มีข้อมูลสำหรับสร้าง PDF

# errorCreatingPDF
source: Error creating PDF: {error}
th: เกิดข้อผิดพลาดในการสร้าง PDF: {error}

source: Copy Text
th: คัดลอกข้อความ

# copyToClipboard
source: Copy data to clipboard
th: คัดลอกข้อมูลไปยังคลิปบอร์ด

source: No data to copy
th: ไม่มีข้อมูลสำหรับคัดลอก

# copiedSuccessfully
source: Data copied successfully!
th: คัดลอกข้อมูลเรียบร้อยแล้ว!

# errorCopying
source: Error copying: {error}
th: เกิดข้อผิดพลาดในการคัดลอก: {error}

source: Share Achievement
th: แชร์ความสำเร็จ

source: New Achievement!
th: ความสำเร็จใหม่!

# justCompletedChallenge
source: I just completed this challenge in Health Tracking App! ðŸ’ª
th: ฉันเพิ่งทำสำเร็จความท้าทายนี้ใน Health Tracking App! 💪

source: Volume (ml)
th: ปริมาณ (ml)

# todayGlasses
source: Today: {count} glasses
th: วันนี้: {count} แก้ว

# addBeverageTooltip
source: Add beverage
th: เพิ่มเครื่องดื่ม

# beverageNameHint
source: Beverage name (e.g. water, tea...)
th: ชื่อเครื่องดื่ม (เช่น น้ำเปล่า ชา...)

# pleaseEnterName
source: Please enter a name
th: กรุณากรอกชื่อ

source: Choose from list
th: เลือกจากรายการ

source: Select Profile Photo
th: เลือกรูปโปรไฟล์

source: Gallery
th: แกลเลอรี่

source: Camera
th: กล้อง

# errorOccurred2
source: An error occurred: {error}
th: เกิดข้อผิดพลาด: {error}

source: Delete Goal
th: ลบเป้าหมาย

source: Goal deleted successfully
th: ลบเป้าหมายสำเร็จ

source: Health Trends
th: แนวโน้มสุขภาพ

source: Profile setup completed!
th: ตั้งค่าโปรไฟล์เสร็จสมบูรณ์!

source: Uranus Code
th: รหัสยูเรนัส

# confirmDeleteGoal
source: Are you sure you want to delete "{title}"?
th: คุณแน่ใจหรือไม่ที่จะลบ "{title}"?

source: Delete
th: ลบ

# pleaseEnterGoalTitle
source: Please enter a goal title
th: กรุณากรอกชื่อเป้าหมาย

# pleaseEnterDescription
source: Please enter a description
th: กรุณากรอกคำอธิบาย

source: Goal added successfully!
th: เพิ่มเป้าหมายสำเร็จ!

# errorWithDetails
source: Error: {error}
th: ผิดพลาด: {error}

source: No data available
th: ยังไม่มีข้อมูล

source: Youtube Channel
th: ช่อง Youtube

source: No data
th: ไม่มีข้อมูล

# errorSelectingImage
source: Error selecting image: {error}
th: เกิดข้อผิดพลาดในการเลือกรูp: {error}

source: Take Photo
th: ถ่ายรูป

source: Select from Gallery
th: เลือกจากแกลเลอรี่

source: Delete Photo
th: ลบรูป

source: Meal data saved successfully
th: บันทึกข้อมูลอาหารเรียบร้อยแล้ว

# errorOccurredWithDetails
source: An error occurred: {error}
th: เกิดข้อผิดพลาด: {error}

source: Active Goals
th: เป้าหมายที่ใช้งาน

source: Achievements
th: ความสำเร็จ

source: Add your first goal
th: เพิ่มเป้าหมายแรกของคุณ

source: Add Goal
th: เพิ่มเป้าหมาย

source: Drink Water
th: ดื่มน้ำ

# sleepGoal
source: Sleep
th: นอนหลับ

# weightGoal
source: Weight
th: น้ำหนัก

source: glasses
th: แก้ว

source: minutes
th: นาที

# hours
source: hrs
th: ชม.

source: kg
th: กก.

source: General
th: ทั่วไป

source: Goal Title
th: ชื่อเป้าหมาย

source: Description
th: คำอธิบาย

source: Category
th: หมวดหมู่

# targetValue
source: Target Value ({unit})
th: ค่าเป้าหมาย ({unit})

source: Goal
th: เป้าหมาย

source: Meal Logging
th: การบันทึกมื้ออาหาร

source: Select meal time
th: เลือกช่วงเวลาการบันทึก

source: Breakfast
th: เช้า

source: Lunch
th: เที่ยง

source: Dinner
th: เย็น

source: Snack
th: ของว่าง

source: Food Name
th: ชื่อเมนู

source: Enter food name
th: กรอกชื่อเมนูอาหาร

source: Meal Photo
th: รูปอาหาร

source: Add Photo
th: แกะฟิวเจอร์

source: Meal Description
th: ข้อมูลอาหาร

# enterMealDescription
source: Enter meal description, e.g., portion size, restaurant, cooking method, etc.
th: ระบุรายละเอียดเพิ่มเติม เช่น ส่วนประกอบ, ร้านค้า, วิธีทำอาหาร และอื่นๆ

source: Save Meal
th: บันทึกข้อมูล

source: Please enter food name
th: กรุณากรอกชื่อเมนูอาหาร

# imageSelectionError
source: Image selection error: {error}
th: เกิดข้อผิดพลาดในการเลือกรูป: {error}

source: Notification Settings
th: การตั้งค่าการแจ้งเตือน

# notificationSettingsDescription
source: Customize your reminder preferences
th: ปรับแต่งการแจ้งเตือนตามความต้องการ

source: Health Reminders
th: การแจ้งเตือนสุขภาพ

source: Water Reminder
th: แจ้งเตือนดื่มน้ำ

# waterReminderDescription
source: Remind me to stay hydrated throughout the day
th: แจ้งเตือนให้ดื่มน้ำให้เพียงพอตลอดวัน

source: Exercise Reminder
th: แจ้งเตือนออกกำลังกาย

# exerciseReminderDescription
source: Remind me to exercise regularly
th: แจ้งเตือนให้ออกกำลังกายอย่างสม่ำเสมอ

source: Sleep Reminder
th: แจ้งเตือนการนอนหลับ

# sleepReminderDescription
source: Remind me to maintain healthy sleep schedule
th: แจ้งเตือนให้รักษาเวลานอนที่ดี

source: Meal Logging Reminder
th: แจ้งเตือนบันทึกมื้ออาหาร

# mealLoggingReminderDescription
source: Remind me to log my meals
th: แจ้งเตือนให้บันทึกมื้ออาหาร

source: Quick Actions
th: การดำเนินการด่วน

source: Reset to Default
th: รีเซ็ตเป็นค่าเริ่มต้น

# resetNotificationConfirmation
source: Are you sure you want to reset all notification settings to default? This will enable all reminders.
th: คุณแน่ใจหรือไม่ที่จะรีเซ็ตการตั้งค่าการแจ้งเตือนทั้งหมดเป็นค่าเริ่มต้น? การกระทำนี้จะเปิดการแจ้งเตือนทั้งหมด

# notificationSettingsReset
source: Notification settings have been reset to default
th: การตั้งค่าการแจ้งเตือนได้รีเซ็ตเป็นค่าเริ่มต้นแล้ว

source: Statistics
th: สถิติ

source: Daily
th: รายวัน

source: Weekly
th: รายสัปดาห์

source: Monthly
th: รายเดือน

source: Sleep Hours
th: ชั่วโมงการนอน

source: Water Intake (ml)
th: การดื่มน้ำ (มล.)

# exerciseCalories
source: Exercise (kcal)
th: การออกกำลังกาย (แคล)

source: Latest
th: ล่าสุด

source: Average
th: เฉลี่ย

# goalLabel
source: Goal
th: เป้าหมาย

# milliliters
source: ml
th: มล.

# calories
source: kcal
th: แคล
